modm-ext/data.modm.io/docs/svd/header_stm32u545xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM2_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM3_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM4_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM5_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM6_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART3">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <groupName>CRS</groupName>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <groupName>FDCAN_Config</groupName>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM1">
      <name>TIM1_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50012c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI1_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM8">
      <name>TIM8_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50013400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART3">
      <name>USART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50013800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM15">
      <name>TIM15_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM16_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI1_S</name>
      <description>Serial Audio Interface</description>
      <groupName>SAI</groupName>
      <baseAddress>0x50015400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB_DRD_FS">
      <name>USB_DRD_FS_S</name>
      <description>Universal Serial Bus Full Speed Dual Role Device</description>
      <groupName>USB_DRD</groupName>
      <baseAddress>0x50016000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB_DRD_PMA_BUFF">
      <name>USB_DRD_PMA_BUFF_S</name>
      <description>Universal Serial Bus PacketMemoryArea Buffer Descriptor Table</description>
      <groupName>USB_DRD_PMABuffDesc</groupName>
      <baseAddress>0x50016400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA1_S</name>
      <description>DMA Controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x50020000</baseAddress>
    </peripheral>
