modm-ext/data.modm.io/docs/svd/header_stm32u545xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RAMCFG_BKPRAM">
      <name>RAMCFG_BKPRAM_S</name>
      <description>SRAMs configuration controller</description>
      <groupName>RAMCFG</groupName>
      <baseAddress>0x50026100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ICACHE">
      <name>ICACHE_S</name>
      <description>Instruction Cache</description>
      <groupName>ICACHE</groupName>
      <baseAddress>0x50030400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCACHE1">
      <name>DCACHE1_S</name>
      <description>Data Cache</description>
      <groupName>DCACHE</groupName>
      <baseAddress>0x50031400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZSC1">
      <name>GTZC_TZSC1_S</name>
      <description>Global TrustZone Controller</description>
      <groupName>GTZC_TZSC</groupName>
      <baseAddress>0x50032400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZIC1">
      <name>GTZC_TZIC1_S</name>
      <groupName>GTZC_TZIC</groupName>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB1_S</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x50032c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB2_S</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x50033000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOA_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC1_S</name>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x52028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC12_COMMON">
      <name>ADC12_COMMON_S</name>
      <groupName>ADC_Common</groupName>
      <baseAddress>0x52028308</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCMI">
      <name>DCMI_S</name>
      <description>DCMI</description>
      <groupName>DCMI</groupName>
      <baseAddress>0x5202c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>PSSI_S</name>
      <description>PSSI</description>
      <groupName>PSSI</groupName>
      <baseAddress>0x5202c400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>AES_S</name>
      <description>AES hardware accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x520c0000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="HASH">
      <name>HASH_S</name>
      <description>HASH</description>
      <groupName>HASH</groupName>
      <baseAddress>0x520c0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>RNG_S</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x520c0800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>SAES_S</name>
      <description>AES hardware accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x520c0c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>PKA_S</name>
      <description>PKA</description>
      <groupName>PKA</groupName>
      <baseAddress>0x520c2000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OTFDEC1">
      <name>OTFDEC1_S</name>
      <groupName>OTFDEC</groupName>
      <baseAddress>0x520c5000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC1_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x520c8000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520c8400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520cf000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x520d1400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SYSCFG">
      <name>SYSCFG_S</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x56000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x56002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x56002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x56002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004c00</baseAddress>
    </peripheral>
